In [1]:
import glob
import pandas as pd

In [2]:
csv_files = glob.glob('data/*.csv')

In [3]:
csv_files

['data\\car_data_0.csv',
 'data\\car_data_1.csv',
 'data\\car_data_2.csv',
 'data\\car_data_3.csv',
 'data\\car_data_4.csv',
 'data\\car_data_5.csv',
 'data\\car_data_6.csv',
 'data\\car_data_7.csv',
 'data\\car_data_8.csv',
 'data\\car_data_9.csv']

#### Maximum mileage of cars with year 2016 or more

In [16]:
mileage_data_list = []

for file in csv_files:
    data = pd.read_csv(file)
    data_2016_or_more = data[data.year >= 2016]
    mileage_data_list.append(data_2016_or_more[['car_id', 'year', 'mileage']].iloc[[0]])
    
mileage_df = pd.concat(mileage_data_list, axis=0)

In [19]:
mileage_df.sort_values('mileage', ascending=False)

      car_id  year       mileage
1786     242  2017  95719.952752
150      191  2018  85868.877446
272      279  2016  84795.282760
630      863  2018  77954.561597
367      248  2016  72368.171622
504      452  2016  55315.514292
550      402  2017  25425.724424
126      610  2016  16943.937511
0        636  2018  11957.484354
0        460  2018  10673.740713

#### Which car travelled the most distance in x axis ?

In [54]:
distance_data_list = []

for file in csv_files:
    data = pd.read_csv(file)
    distances = data.groupby('car_id').agg(dist_x=('position_x', lambda x: x.diff().fillna(0).abs().sum())).reset_index()
    distance_data_list.append(distances)

In [55]:
all_distances = pd.concat(distance_data_list, axis=0)

In [57]:
all_distances.groupby('car_id').sum().sort_values('dist_x', ascending=False)

             dist_x
car_id
255     5599.778868
768     5030.847064
682     5029.349498
935     4960.019765
299     4678.708286
...             ...
372      172.572001
303      169.990424
73       148.785635
67       121.406486
582       55.959250

[999 rows x 1 columns]